In [1]:
import pandas as pd

## First names (INSEE 2022)

https://www.insee.fr/fr/statistiques/7633685?sommaire=7635552

In [5]:
nat = pd.read_csv("nat2022.csv", sep=";")

In [19]:
colpre = 'preusuel'

In [14]:
prenoms = nat[colpre].unique()
len(prenoms)

36964

In [21]:
nat[nat[colpre]==prenoms[0]]

        sexe        preusuel annais  nombre
0          1  _PRENOMS_RARES   1900    1249
1          1  _PRENOMS_RARES   1901    1342
2          1  _PRENOMS_RARES   1902    1330
3          1  _PRENOMS_RARES   1903    1286
4          1  _PRENOMS_RARES   1904    1430
...      ...             ...    ...     ...
321399     2  _PRENOMS_RARES   2018   26985
321400     2  _PRENOMS_RARES   2019   27630
321401     2  _PRENOMS_RARES   2020   27914
321402     2  _PRENOMS_RARES   2021   28211
321403     2  _PRENOMS_RARES   2022   29396

[246 rows x 4 columns]

In [22]:
_['nombre']

0          1249
1          1342
2          1330
3          1286
4          1430
          ...
321399    26985
321400    27630
321401    27914
321402    28211
321403    29396
Name: nombre, Length: 246, dtype: int64

In [23]:
_.sum()

1760252

In [32]:
d = {}
s = 0
for (i, p) in enumerate(prenoms):
    d[p] = nat[nat[colpre]==p]['nombre'].sum()
    s+=1
    if s > len(prenoms)/40:
        s = 0
        print(i/len(prenoms))

0.024997294665079536
0.0500216426793637
0.07504599069364787
0.10007033870793204
0.12509468672221621
0.15011903473650037
0.17514338275078456
0.20016773076506872
0.22519207877935288
0.25021642679363704
0.2752407748079212
0.3002651228222054
0.32528947083648957
0.35031381885077373
0.3753381668650579
0.40036251487934205
0.4253868628936262
0.4504112109079104
0.4754355589221946
0.5004599069364787
0.5254842549507629
0.5505086029650471
0.5755329509793312
0.6005572989936154
0.6255816470078995
0.6506059950221837
0.675630343036468
0.7006546910507521
0.7256790390650363
0.7507033870793204
0.7757277350936046
0.8007520831078887
0.8257764311221729
0.8508007791364571
0.8758251271507412
0.9008494751650254
0.9258738231793096
0.9508981711935938
0.975922519207878

In [47]:
s = pd.Series(d).sort_values(ascending=False)
s

MARIE             2258792
JEAN              1913115
_PRENOMS_RARES    1760252
PIERRE             893126
MICHEL             820677
                   ...
GAÊL                   20
LYÏA                   20
STEFANNY               20
YURIY                  20
NaN                     0
Length: 36964, dtype: int64

In [51]:
s.to_csv("prenoms_sorted_by_count.csv", header=False)

## Last names (INSEE 2008)

https://www.insee.fr/fr/statistiques/3536630

In [61]:
df = pd.read_csv('noms2008nat_txt.txt', sep='\t')
df

,NOM,_1891_1900,_1901_1910,_1911_1920,_1921_1930,_1931_1940,_1941_1950,_1951_1960,_1961_1970,_1971_1980,_1981_1990,_1991_2000
0,AABI,0,0,0,0,0,0,0,0,4,21,7
1,AABID,0,0,0,0,0,0,0,0,7,13,17
2,AALBERG,1,5,2,5,4,6,4,2,1,0,0
3,AAMARA,0,0,0,0,0,0,0,1,11,5,15
4,AARAB,0,0,0,0,0,0,0,3,63,204,139
...,...,...,...,...,...,...,...,...,...,...,...,...
218978,ZYSK,0,0,0,4,4,3,12,4,7,10,11
218979,ZYSMAN,0,0,0,8,19,3,14,17,7,10,8
218980,ZYTA,0,0,0,1,1,4,12,7,8,11,1
218981,ZYTO,0,0,1,9,3,8,9,8,8,8,3
218982,AUTRES NOMS,227267,319995,284557,409790,382905,441726,522040,604057,666868,757419,857392

In [63]:
cols = df.columns
cols

Index(['NOM', '_1891_1900', '_1901_1910', '_1911_1920', '_1921_1930',
       '_1931_1940', '_1941_1950', '_1951_1960', '_1961_1970', '_1971_1980',
       '_1981_1990', '_1991_2000'],
      dtype='object')

Summing counts over all the years:

In [76]:
def f(s):
    return s.iloc[1:].sum()
    
df.apply(f, axis=1)

0              32
1              37
2              30
3              32
4             409
           ...
218978         55
218979         86
218980         45
218981         57
218982    5474016
Length: 218983, dtype: int64

Then, a memo for apply (just ignore this)

In [68]:
_d = pd.DataFrame({
    1: {"a": 1, "b": 13},
    2: {"a": 22, "b": 12},
})

In [71]:
_d.apply(lambda c: c.sum(), axis=1)

a    23
b    25
dtype: int64

In [70]:
_d

    1   2
a   1  22
b  13  12

In [82]:
cdf = pd.DataFrame({
    'nom': df['NOM'], 
    'count': df.apply(f, axis=1)
})

In [87]:
pd.Series(cdf['count'], index=cdf['nom'])

nom
AABI          NaN
AABID         NaN
AALBERG       NaN
AAMARA        NaN
AARAB         NaN
               ..
ZYSK          NaN
ZYSMAN        NaN
ZYTA          NaN
ZYTO          NaN
AUTRES NOMS   NaN
Name: count, Length: 218983, dtype: float64

In [93]:
cdf.set_index(cdf['nom'])['count'].sort_values(ascending=False)

nom
AUTRES NOMS     5474016
MARTIN           250013
BERNARD          131330
THOMAS           118331
PETIT            115217
                 ...
MANIERES             30
COMTE-FLORET         30
DEHIL                30
DOUCET-BON           30
MILLUL               30
Name: count, Length: 218983, dtype: int64

In [94]:
_.to_csv('noms_sorted_by_count.csv', header=None)